Autodesk.Revit.DB.ExternalResourceUtils.IsTypeVisiableIfSouceNotFound(Autodesk.Revit.DB.ExternalResourceType)
Checks whether a given ExternalResourceType is one for which the
host document needs the source file to load.
Remarks:
For CAD links and the keynote table, host document has all the data and it's ok if the file's missing.
For Revit and IFC links, host document can't store all of the info about the link and so
host document needs to find and read the source file in order to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015